/*---------------------------------------------------------------------------------------------------------*/
/*                                                                                                         */
/* Copyright(c) 2017 Nuvoton Technology Corp. All rights reserved.                                         */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/

//***********************************************************************************************************

//***********************************************************************************************************
#include "led.h"
void Init_led(void)//LED≥ı ºªØ
{
		do {LED1_GPIO_CLK_ENABLE(); } while(0U);
		/* Configure the GPIO_LED pin */
		LL_GPIO_SetPinMode(LED1_GPIO_PORT, LED1_GPIO_PIN, LL_GPIO_MODE_OUTPUT);
    

		/* πÿ±’LED	*/
		LL_GPIO_ResetOutputPin(BEEP_GPIO_PORT, BEEP_GPIO_PIN);	
}
